<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Logotipo da rede de habilidades">
    </a>
</p>

# Laboratório prático: seleção de dados em um Dataframe

Tempo estimado necessário: **30** minutos

## Objetivos

Depois de concluir este laboratório, você será capaz de:

* Use a Biblioteca Pandas para criar DataFrame e Séries
* Localize dados no DataFrame usando as funções <code>loc()</code> e <code>iloc()</code>
* Use fatiamento

### Exercício 1: Pandas: DataFrame e Série

**Pandas** é uma biblioteca popular para análise de dados desenvolvida com base na linguagem de programação Python. Pandas geralmente fornecem duas estruturas de dados para manipulação de dados.
 
* Quadro de dados
* Series

Um **DataFrame** é uma estrutura de dados bidimensional, ou seja, os dados são alinhados de forma tabular em linhas e colunas.

* Um DataFrame do Pandas será criado carregando os conjuntos de dados do armazenamento existente.
* O armazenamento pode ser banco de dados SQL, arquivo CSV, arquivo Excel, etc.
* Também pode ser criado a partir de listas, dicionários e de uma lista de dicionários.

**Série** representa uma matriz unidimensional de dados indexados.
Possui dois componentes principais:
1. Uma matriz de dados reais.
2. Uma matriz associada de índices ou rótulos de dados.

O índice é usado para acessar valores de dados individuais. Você também pode obter uma coluna de um dataframe como **Series**. Você pode pensar em uma série Pandas como um dataframe 1-D.

In [2]:
# let us import the Pandas Library
import pandas as pd

Depois de importar o pandas, você poderá usar as funções integradas nele para criar e analisar dados.

**Neste laboratório prático, aprenderemos como criar um DataFrame a partir de um dicionário.**

Vamos considerar um dicionário 'x' com chaves e valores conforme mostrado abaixo.

Em seguida, criamos um dataframe a partir do dicionário usando a função pd.DataFrame(dict)

In [41]:
#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

Podemos ver a correspondência direta entre a tabela. As chaves correspondem aos rótulos das colunas e os valores ou listas correspondem às linhas.

#### Seleção de coluna:

Para selecionar uma coluna no Pandas DataFrame, podemos acessar as colunas chamando-as pelo nome das colunas.

Vamos recuperar os dados presentes na coluna <code>ID</code>.

In [4]:
#Retrieving the "ID" column and assigning it to a variable x
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

Vamos usar a função <code>type()</code> e verificar o tipo da variável

In [5]:
#check the type of x
type(x)

pandas.core.frame.DataFrame

A saída nos mostra que o tipo da variável é um objeto DataFrame.

#### Acesso a múltiplas colunas

Vamos recuperar os dados das colunas <code>Departamento</code>, <code>Salário</code> e <code>ID</code>

In [7]:
#Retrieving the Department, Salary and ID columns and assigning it to a variable z

z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

## **Tente você mesmo**

##### Problema 1: Crie um dataframe para exibir o resultado conforme abaixo:

<center>
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/images/Student_data.png" width="300" alt="Student Data">
</center>

In [42]:
import pandas as pd

a = {'Student':['David', 'Samuel','Terry', 'Evan'], 
     'Age':[ 27, 24, 22, 32], 
     'Country':['UK','Canada', 'China', 'USA'], 
     'Course':['Python', 'Data Structure', 'Machine Learning', 'Web Development'], 
     'Marks':[85, 72, 89, 76]}

In [32]:
df1 = pd.DataFrame(a)
df1

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada    Data Structure     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

Problema 2: recuperar a coluna Marcas e atribuí-la a uma variável b

In [33]:
b = df1[['Marks']]
b

   Marks
0     85
1     72
2     89
3     76

Problema 3: Recuperar as colunas País e Curso e atribuí-las a uma variável c

In [34]:
c = df1[['Country','Course']]
c

  Country            Course
0      UK            Python
1  Canada    Data Structure
2   China  Machine Learning
3     USA   Web Development

**To view the column as a series, just use one bracket:**

In [35]:
# Get the Student column as a series Object

x = df1['Student']
x

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [36]:
#check the type of x
type(x)

pandas.core.series.Series

### Exercício 2: funções <code>loc()</code> e <code>iloc()</code>

<code>loc()</code> é um método de seleção de dados baseado em rótulo, o que significa que temos que passar o nome da linha ou coluna que queremos selecionar. Este método inclui o último elemento do intervalo passado nele.

Sintaxe simples para sua compreensão:

 - loc[row_label, column_label]

<code>iloc()</code> é um método de seleção baseado em índice, o que significa que temos que passar um índice inteiro no método para selecionar uma linha/coluna específica. Este método não inclui o último elemento do intervalo passado nele.

Sintaxe simples para sua compreensão:
   
 - iloc[row_index, column_index]

<h4 id="data">Vejamos alguns exemplos disso.</h4>

In [38]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'David'

In [39]:
# Access the value on the first row and the third column

df.iloc[0,2]

'UK'

In [43]:
# Access the column using the name

df.loc[0, 'Salary']

100000

In [45]:
df2=df
df2=df2.set_index("Name")

In [46]:
#To display the first 5 rows of new dataframe
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [47]:
#Now, let us access the column using the name
df2.loc['Jane', 'Salary']

50000

### Tente você mesmo

Use the <code>loc()</code> function,to get the Department of Jane in the newly created dataframe df2.

In [48]:
df2.loc['Jane', 'Department']

'Design Team'

Use a função <code>iloc()</code> para obter o Salário de Maria no dataframe df2 recém-criado.

In [49]:
df2.iloc[3,2]

60000

### Exercício 3: Fatiar (Slicing)

O fatiamento usa o operador [] para selecionar um conjunto de linhas e/ou colunas de um DataFrame.

Para dividir um conjunto de linhas, você usa esta sintaxe: data[start:stop],

aqui o início representa o índice de onde considerar e o fim representa o índice um passo ALÉM da linha que você deseja selecionar. Você pode realizar o fatiamento usando o índice e o nome da coluna.

> NOTA: Ao fatiar pandas, o limite inicial é incluído na saída.

Portanto, se você quiser selecionar as linhas 0, 1 e 2, seu código ficará assim: df.iloc[0:3].

Isso significa que você está dizendo ao Python para começar no índice 0 e selecionar as linhas 0, 1, 2 até, mas não incluindo, 3.

> NOTA: Os rótulos devem ser encontrados no DataFrame ou você receberá um KeyError.

A indexação por rótulos (ou seja, usando <code>loc()</code>) difere da indexação por números inteiros (ou seja, usando <code>iloc()</code>). Com <code>loc()</code>, tanto o limite inicial quanto o limite final são inclusivos. Ao usar <code>loc()</code>, números inteiros podem ser usados, mas os números inteiros referem-se ao rótulo do índice e não à posição.

Por exemplo, usar <code>loc()</code> e selecionar 1:4 obterá um resultado diferente de usar <code>iloc()</code> para selecionar linhas 1:4.

<h4 id="data">Também podemos selecionar um valor de dados específico usando uma localização de linha e coluna dentro do DataFrame e da indexação iloc.

In [50]:
# let us do the slicing using old dataframe df

df.iloc[0:2, 0:3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [51]:
#let us do the slicing using loc() function on old dataframe df where index column is having labels as 0,1,2
df.loc[0:2,'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [52]:
#let us do the slicing using loc() function on new dataframe df2 where index column is Name having labels: Rose, John and Jane
df2.loc['Rose':'Jane', 'ID':'Department']

      ID       Department
Name
Rose   1  Architect Group
John   2   Software Group
Jane   3      Design Team

### Tente você mesmo

usando a função <code>loc()</code>, faça o fatiamento no dataframe antigo df para recuperar o nome, ID e departamento da coluna de índice com rótulos como 2,3

In [53]:
df.loc[2:3,'Name':'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure